app/Controllers/SocioController.php

    public function mostrar()
    {
        $socioModel = new socioModel($db);
        if (strtolower($this->request->getMethod()) !== 'post') {
            return view('socioView\mostrarSocioView', [
                'socios' => $socioModel->findAll(),
            ]);
---
SELECT *
FROM "socios"