app/Controllers/SocioController.php

            $dataSocio['validation'] = $this->validator;
            return view('socioView\createSocioView', $dataSocio);
        }
        $socio = $socioModel->where('dni', $request->getPost('inputDocumento'))->findAll();
---
SELECT *
FROM "socios"
WHERE "dni" = '12414142412'

    public function mostrar()
    {
        $socioModel = new socioModel($db);
        if (strtolower($this->request->getMethod()) !== 'post') {
            return view('socioView\mostrarSocioView', [
                'socios' => $socioModel->findAll(),
            ]);
---
SELECT *
FROM "socios"