app/Controllers/SocioController.php

INSERT INTO "socios" ("nombre_apellido", "dni", "edad", "telefono", "direccion", "mail", "id_categoria") VALUES ('Guau', '43123312', '67', '2664123456', 'Pasaje Buen Pastor', 'math4656i@gmail.com', '4')
---
        $dataVeterano = array(
            'enfermedad_coronaria' => $enfermedad,
        );
        if (!$socioModel->insert($dataSocio)) {

SELECT *
FROM "socios"
WHERE "dni" = '43123312'
---

            return view('socioView\createSocioView', $dataSocio);
        }
        $socio = $socioModel->where('dni', $request->getPost('inputDocumento'))->findAll();

DELETE FROM "socios"
WHERE "id_socio" = '3'
---
        if ($request->getPost('selectCategoria') == 1) {
            if (!$infantilModel->insert($datainfantil)) {

                $socioModel->where('id_socio', $socio[0]['id_socio'])->delete();

INSERT INTO "veteranos" ("enfermedad_coronaria", "id_socio") VALUES (TRUE, '5')
---
            }
        }
        if ($request->getPost('selectCategoria') == 4) {
            if (!$veteranoModel->insert($dataVeterano)) {

SELECT *
FROM "socios"
JOIN "infantiles" ON "socios"."id_socio" = "infantiles"."id_socio"
SELECT *
FROM "socios"
WHERE "id_categoria" = 2
SELECT *
FROM "socios"
WHERE "id_categoria" = 3
SELECT *
FROM "socios"
JOIN "veteranos" ON "socios"."id_socio" = "veteranos"."id_socio"
---
    public function mostrar()
    {
        $socioModel = new socioModel($db);
        // if (strtolower($this->request->getMethod()) !== 'post') {
        //     return view('socioView\mostrarSocioView', [
        //         'sociosC' => $socioModel->findAll(),
        //     ]);
        // }
        if (strtolower($this->request->getMethod()) !== 'post') {
            $socios[0] = $socioModel->join("infantiles", "socios.id_socio = infantiles.id_socio")->findAll();
            $socios[1] = $socioModel->where('id_categoria', 2)->findAll();
            $socios[2] = $socioModel->where('id_categoria', 3)->findAll();
            $socios[3] = $socioModel->join('veteranos', 'socios.id_socio = veteranos.id_socio')->findAll();